/* 
  Alerts.strings
  CleanMyMac

  Created by Vera Tkachenko on 2/22/15.
  Copyright (c) 2015 MacPaw. All rights reserved.
*/

/* Buttons */
"AlertButton_Continue" = "Continue";
"AlertButton_BuyLicense" = "Buy License";
"AlertButton_BuyLicenseWithDiscount" = "Buy at %li%% Off";
"AlertButtonTitle_Erase" = "Shred";

/* App Termination */
"AlertButton_ContinueScan" = "Continue Scan";
"AlertButton_ContinueClean" = "Continue Cleanup";
"AlertButton_QuitCompleteTasks" = "Complete All and Quit";
"AlertButton_QuitForce" = "Force Quit";
"AlertButton_CheckForBeta" = "Check for Beta Updates";
"Stop" = "Stop";

"AlertButtonTitle_Uninstall" = "Uninstall";
"AlertButtonTitle_DontUninstall" = "Don't Uninstall";

"AlertButtonTitle_Reset" = "Reset";

/* Running not from Apps folder */
"AlertButtonTitle_Install" = "Install";
"AlertButtonTitle_DontInstall" = "Don't Install";
"AlertButtonTitle_Overwrite" = "Overwrite";
"AlertButtonTitle_DontOverWrite" = "Don't Overwrite";


/* Beta Updates Alert */
"AlertDescription_BetaUpdateEnabling" = "Beta-versions give you access to some features and functionality before their official public release. Please be aware that Beta versions of CleanMyMac may be unstable and may result in data loss. Use them at your own risk. MacPaw does NOT provide technical support for Beta Versions and is not responsible for any damage caused by these versions.\n\nBeta users can help us improve our software by providing feedback through the 'Provide Feedback...' option of the 'Help' menu.";

"AlertTitle_BetaUpdateEnabling" = "Are you sure you would like to try Beta versions of CleanMyMac?";

/* Reset Ignore List Alert */
"AlertDescription_ResetIgnoreList" = "This will allow CleanMyMac to scan and remove the items you have earlier added to the Ignore List for any reason.";

"AlertTitle_ResetIgnoreList" = "Are you sure you want to reset the list of ignored items to default?";

/* Activation */
"AlertTitle_CleaningWithinLimitAlert" = "Your copy of CleanMyMac is not registered.";

"AlertDescription_CleaningWithinLimitAlert" = "You have %@ left to clean in this Demo version of CleanMyMac 3. An activated copy has no limitations and lets you fully experience all the benefits of being a registered CleanMyMac 3 user.";

/* Uninstalling CMM */
"AlertDescription_UninstallingCMM" = "CleanMyMac is the application you are working with at this point. It will be closed and completely removed if you click the Uninstall button.\nWould you like to uninstall CleanMyMac?";

"AlertTitle_UninstallingCMM" = "Uninstalling CleanMyMac application";

/* Reseting CMM */
"AlertDescription_ResetCMM" = "Please reopen the application before using it further.";
"AlertTitle_ResetCMM" = "You have just reset CleanMyMac's preference files and it needs to be reopened to work properly.";
"AlertButton_ConfirmSelfRestart" = "Reopen";
"AlertButton_CancelSelfRestart" = "Cancel";

/* Uninstalling Setapp */

"AlertTitle_UninstallingSetappMessage" = "You have selected Setapp and %li of its applications for complete uninstallation. Are you sure you want to select Setapp along with the related applications?";
"AlertDescription_UninstallingSetappMessage" = "Please note that this service provides you with an ever-growing collection of apps, which you won’t access without the main Setapp app.";
"AlertButton_SelectSetappApplications" = "Select Setapp Applications";
"AlertCheckboxText_UninstallingSetappMessage" = "Do not show this message again";

/* Drop iPhoto alert */
"AlertDescription_DropiPhotoWhileScanning" = "Starting a new scan will discard current scan results.";

"AlertTitle_DropiPhotoWhileScanning" = "Scan Another Library.";

/* Logging mode alert */
"AlertTitle_LoggingMode" = "Turning on extended logging mode.";

"AlertDescription_LoggingMode" = "CleanMyMac will keep an extended log of all the items it locates. Our support team will more likely help you resolve any of the possible issues rapidly if you reproduce your problem and report it with the extended logging turned on.";

/* Need To Close Applications Alert */
"AlertDescription_GenericAuth" = "CleanMyMac needs your permission to make changes required by its functionality.";

/* Extensions Authorize Alert */
"AlertDescription_ExtensionsAuthFormat" = "Please authorize CleanMyMac to %@ this extension and perform other operations which require Administrative rights.";

"ExtensionsAuthAlert_EnableAction" = "enable";

"ExtensionsAuthAlert_DisableAction" = "disable";

/* CMM force quit alert */
"AlertTitle_ForceQuit" = "CleanMyMac could not quit normally the last time you attempted to close it.";

"AlertDescription_ForceQuit" = "Some cleanup-related processes are still running and may result in data loss or unexpected system behavior if interrupted. It is recommended to complete all processes and quit afterwards.";

/* CMM running not from Apps folder alerts */
"AlertMessageText_RunningNotFromAppFolder" = "CleanMyMac is not running from the recommended Applications folder.";

"AlertInformativeText_WishInstallQuestion" = "Would you like to install CleanMyMac into your Applications folder before quitting?";

"AlertTitle_AlreadyInstalled" = "CleanMyMac is already installed on your system!";

"AlertTitle_OverwriteQuestion" = "Would you like to overwrite CleanMyMac in your Applications folder?";

"AlertTitle_InstallationFailder" = "Installation of CleanMyMac failed!";

"AlertTitle_CopyToApplicationFolderSuggestion" = "Try to copy it to a desired location manually. The recommended location is your Applications folder.";

/* Selection Alert LargeOldFiles */
"SelectionCautionAlertTitle_LargeOld" = "You have selected several personal files for complete removal.";

"SelectionCautionAlertMessage_LargeOld" = "Please note that the Large & Old Files module does not suggest items that may be safely removed. Please use it as a reference and be careful when deciding on removing a file.";

/* Selection Alert Uninstaller */
"SelectionCautionAlertTitle_Uninstaller" = "You have selected several applications for uninstallation.";

"SelectionCautionAlertMessage_Uninstaller" = "Please note that the Uninstaller module is aimed to remove applications completely and they will be gone from your system after you use the Uninstall button.";

/* Remove Alerts LargeOldFiles */
"RemoveAlertMessageText_LargeOld1File" = "Are you sure you want to permanently remove \"%@\"?";

"RemoveAlertMessageText_LargeOldXFiles" = "Are you sure you want to permanently remove %@?";

"RemoveAlertInformativeText_LargeOldFilesGroupScanner" = "You can't undo this action.";

/* Remove Alerts Uninstaller */
"RemoveAlertMessageText_Uninstaller1App" = "Are you sure you want to permanently uninstall \"%@\" and all of its related items?";

"RemoveAlertMessageText_UninstallerXApps" = "Are you sure you want to permanently uninstall %@ and all of their related items?";

"RemoveAlertMessageText_Uninstaller1File" = "Are you sure you want to permanently remove \"%@\"?";

"RemoveAlertMessageText_UninstallerRelatedFiles" = "Are you sure you want to permanently remove %@?";

"RemoveAlertMessageText_UninstallerResetApp" = "Are you sure you want to reset \"%@\" by removing all of its related items?";

"RemoveAlertMessageText_UninstallerSelectedItems" = "Are you sure you want to permanently remove all the selected items?";

"RemoveAlertInformativeText_Uninstaller" = "You can't undo this action.";

/* Remove Alerts Extensions */
"RemoveAlertMessageText_Extensions1Item" = "Are you sure you want to permanently remove \"%@\"?";

"RemoveAlertMessageText_ExtensionsXItems" = "Are you sure you want to permanently remove %@?";

"RemoveAlertInformativeText_ExtensionsGroupScanner" = "You can't undo this action.";

/* Remove Alerts Eraser */
"RemoveAlertMessageText_Eraser1Item" = "Are you sure you want to permanently erase \"%@\"?";

"RemoveAlertMessageText_EraserXItems" = "Are you sure you want to permanently erase %@?";

"RemoveAlertInformativeText_EraserGroupScanner" = "You can't undo this action.";

/* Ignored Items alerts */
"AlertTitle_1_IgnoredItemsDidAdd" = "You have added an item to CleanMyMac's Ignore List.";

"AlertTitle_N_IgnoredItemsDidAddFormat" = "You have added %@ to CleanMyMac's Ignore List.";

"AlertDescription_1_IgnoredItemsDidAdd" = "The item will no longer be shown within scan results. You can manage ignored items within Preferences.";

"AlertDescription_N_IgnoredItemsDidAdd" = "These items will no longer be shown within scan results. You can manage ignored items within Preferences.";

"AlertTitle_ShouldSelectIgnoredItem" = "Are you sure you want to select an Ignore-Listed item for removal?";

"AlertDescription_ShouldSelectIgnoredItem" = "Removing such items may affect the functionality of your system or applications related to them.";

/* No comment provided by engineer. */
"AlertTitle_StopCleanWarning" = "Do you want to stop the cleanup process before it finishes?";

/* No comment provided by engineer. */
"AlertTitle_StopScanWarning" = "Do you want to stop the scanning process before it finishes?";

/* No comment provided by engineer. */
"AlertDecription_StopCleanWarning" = "Interrupting the cleanup will leave a certain amount of unnecessary items on your Mac.";

/* No comment provided by engineer. */
"AlertTitle_StartOver" = "Do you want to reset current scan results and start over?";

/* No comment provided by engineer. */
"AlertDecription_StartOver" = "Current scan results won’t be saved and you will need to run a new scan to locate the items.";

/* No comment provided by engineer. */
"AlertTitle_Rescan" = "Do you want to reset current scan results by starting a new scan?";

/* No comment provided by engineer. */
"AlertDescription_Rescan" = "Your current scan results and the list of selected items won't be saved.";

/* No comment provided by engineer. */
"AlertTitle_Refresh" = "Do you want to refresh your current %@ list?";

/* No comment provided by engineer. */
"AlertDescription_Refresh" = "Your current selection of items won't be saved.";

/* No comment provided by engineer. */
"AlertDescription_StopScanWarning" = "Interrupting the scan will give incomplete results for the future cleanup.";

/* No comment provided by engineer. */
"AlertTitle_UnableToEnablePlugin" = "Unable to enable/disable plugin.";

/* No comment provided by engineer. */
"AlertDescription_UnknownError" = "Unknown error occured. Please contact support.";

/* Maintenance verify disk */
"AlertTitle_VerifySystemDiskWarn" = "Your computer may become unresponsive during startup drive verification.";
"AlertDescription_VerifySystemDiskWarn" = "Due to high disk activity during verification, your system may become unresponsive for several minutes. Please treat this as normal behavior.";

/* Alerts */
"AlertDescription_QuitOnScan" = "Quitting the application will interrupt the scan and all the results will be lost.";

/* Alerts */
"AlertDescription_QuitOnClean" = "Quitting the application will interrupt the cleanup process and result in incomplete cleanup results.";

/* Alerts */
"AlertTitle_QuitOnScan" = "Do you want to quit CleanMyMac before the current scan finishes?";

/* Alerts */
"AlertTitle_QuitOnClean" = "Do you want to quit CleanMyMac before cleanup finishes?";

/* System Restart */
"CleanMyMac has just uninstalled %@ malware. A restart of your Mac is required to finish the process." = "CleanMyMac has just uninstalled %@ malware. A restart of your Mac is required to finish the process.";
"Please note that some applications may work incorrectly until your system is restarted." = "Please note that some applications may work incorrectly until your system is restarted.";


/* Self Uninstall Discount */
"SelfUninstallDiscount_AlertTitle" = "Sometimes we can make an exception.";
"SelfUninstallDiscount_AlertDescription" = "And this is one of those cases. Today only, we’re happy to offer you a %li%% discount on the full version of CleanMyMac 3.";

/* Self uninstall alert */
"SelfUninstall_AlertDescription" = "Help us make CleanMyMac better by telling us why you want to uninstall:";
"SelfUninstall_AlertTitle" = "Sorry to see you go!";
"Submit and Uninstall" = "Submit and Uninstall";

"The price is a bit too much." = "The price is a bit too much.";
"It's too hard to use. I had trouble figuring it out." = "It's too hard to use. I had trouble figuring it out.";
"It didn't find enough to clean!" = "It didn't find enough to clean!";
"It doesn't seem safe to use." = "It doesn't seem safe to use.";
"Other:" = "Other:";

"IgnoreList_AlertTitle_AddedMacTrashToIgnoreList" = "Are you sure you want to add your startup drive Trash to Ignore List?";

"IgnoreList_AlertDescription_AddedMacTrashToIgnoreList" = "This will disable the Trash Monitor feature and CleanMyMac 3 will not be notifying you about filled up Trash anymore.";

"IgnoreList_AlertTitle_EnableTrashMonitor" = "Are you sure you want to enable the Trash monitor feature?";

"IgnoreList_AlertDescription_EnableTrashMonitor" = "This will remove your startup drive Trash from CleanMyMac's Ignore List.";

"AlertTitle_VerifySystemDiskWarn" = "Your computer may become unresponsive during startup drive verification.";

"AlertDescription_VerifySystemDiskWarn" = "Due to high disk activity during verification, your system may become unresponsive for several minutes. Please treat this as normal behavior.";

"UnsupportedOSAlert_Message" = "This copy of CleanMyMac does not support macOS %@ and its future versions.";

"UnsupportedOSAlert_Informative" = "Please upgrade to the newest version of CleanMyMac, which is completely compatible with your version of macOS.";

/* Erase System Files Alert */
"EraseSystemFilesAlert_MessageText" = "Some of the items you selected cannot be added to Shredder.";

"EraseSystemFilesAlert_InformativeText" = "Removing these files or folders may damage your system.";

"IgnoreList_AlertTitle_AddedMacTrashToIgnoreList" = "Are you sure you want to add your startup drive Trash to Ignore List?";
"IgnoreList_AlertDescription_AddedMacTrashToIgnoreList" = "This will disable the Trash Monitor feature and CleanMyMac 3 will not be notifying you about filled up Trash anymore.";

"IgnoreList_AlertTitle_EnableTrashMonitor" = "Are you sure you want to enable the Trash monitor feature?";
"IgnoreList_AlertDescription_EnableTrashMonitor" = "This will remove your startup drive Trash from CleanMyMac's Ignore List.";

/* Self Uninstall Discount */
"SelfUninstallDiscount_Uninstall" = "Uninstall";
"SelfUninstallDiscount_Purchase" = "Purchase at %li%% Discount";

/* Buttons */
"Quit" = "Quit";

"Verify System Disk" = "Verify System Disk";
"Download" = "Download";

"Submit" = "Submit";

"Restart" = "Restart";

/* Alert button */
"Cancel" = "Cancel";
"OK" = "OK";
"Remove" = "Remove";

"Start New Scan" = "Start New Scan";

/* Drop Trashes alert */
"AlertTitle_DropWhileScanning_TrashesGroupScanner" = "Scan Another Library.";
"AlertDescription_DropWhileScanning_TrashesGroupScanner" = "Starting a new scan will discard current scan results.";

/* Drop LAOF alert */
"AlertTitle_DropWhileScanning_LargeOldFilesGroupScanner" = "Scan Another Folder.";
"AlertDescription_DropWhileScanning_LargeOldFilesGroupScanner" = "Starting a new scan will discard current scan results.";
"AlertTitle_MoveToAlbumInPhotos_LargeOldFilesGroupScanner" = "Your large and old Photos library items will be gathered in the ‘Large Media to Delete’ album of Photos.";
"AlertDescription_MoveToAlbumInPhotos_LargeOldFilesGroupScanner" = "Please make sure you permanently delete these files using Photos to save space.";

/* Drop iPhoto alert */
"AlertDescription_DropWhileScanning_iPhotoGroupScanner" = "Starting a new scan will discard current scan results.";
"AlertTitle_DropWhileScanning_iPhotoGroupScanner" = "Scan Another Library.";

/* Unsupported Photos Library version */
"AlertTitle_PhotoLibraryUnsupportedOld" = "The library you are trying to scan is not supported by CleanMyMac 3.";
"AlertDescription_PhotoLibraryUnsupportedOld" = "Please consider updating your photo library to a newer version.";
"AlertTitle_PhotoLibraryUnsupportedNew" = "The library you are trying to scan is not yet supported by CleanMyMac 3.";
"AlertDescription_PhotoLibraryUnsupportedNew" = "The version of your photo library is currently being tested for compatibility. Please check back soon.";

/* Activation - Deactivate License Alert */
"ActivationDeactivateLicense_MessageText" = "Are you sure you want to disable your CleanMyMac 3 license on this Mac?";
"ActivationDeactivateLicense_InformativeText" = "This will deactivate the current copy of the application, but you will be able to reuse your license on another computer.";
"Disable License" = "Disable License";

/* Move to Setapp alert */
"AlertMoveToSetapp_Message" = "It looks like you are using Setapp on your Mac. Would you like to switch to the Setapp version of CleanMyMac?";
"AlertMoveToSetapp_Informative" = "It’s all the same and always up to date with the newest releases.";
"AlertMoveToSetapp_Switch" = "Switch";
"AlertMoveToSetapp_DontSwitch" = "No, Thanks";

/* switch to Setapp version of CMM*/
"AlertSwitchToSetappVersionOfCMM_Message" = "It looks like you've been using a non-Setapp version of CleanMyMac earlier.";
"AlertSwitchToSetappVersionOfCMM_InformationText" = "Would you like to switch to the Setapp version and migrate your previous settings?";
"AlertSwitchToSetappVersionOfCMM_Switch" = "Switch";
"AlertSwitchToSetappVersionOfCMM_No_Thanks" = "No, Thanks";
